vitalyruhl/esp32-bacnet-stack/examples/hil-wago-client-acceptance/src/main.cpp
// SPDX-License-Identifier: GPL-2.0-or-later WITH GCC-exception-2.0

#include <Arduino.h>
#include <ArduinoBacnetClient.h>
#include <BacnetClient.h>
#include <BacnetDeviceSession.h>
#include <BacnetDisplayText.h>
#include <BacnetRemoteObject.h>
#include <BacnetHilPrioritySupport.h>
#include <WiFiUdp.h>

#include "HilResultOutput.h"
#include "HilScenarioRunner.h"

#ifndef EXAMPLE_USE_ETHERNET
#define EXAMPLE_USE_ETHERNET 0
#endif

#if EXAMPLE_USE_ETHERNET
#include <ETH.h>
#include <ExampleEthernet.h>
#else
#include <WiFi.h>
#include <Esp32WiFiNetwork.h>
#endif

#if __has_include("secret/secrets.h")
#include "secret/secrets.h"
#define HIL_HAS_LOCAL_SECRETS 1
#else
#include "secret/secrets.example.h"
#define HIL_HAS_LOCAL_SECRETS 0
#endif

#ifndef MY_USE_DHCP
#define MY_USE_DHCP true
#endif

#if EXAMPLE_USE_ETHERNET && !defined(MY_ETHERNET_IP)
#define MY_ETHERNET_IP MY_WIFI_IP
#endif

#ifndef BACNET_TARGET_IP
#ifdef BACNET_TARGET_ADDRESS
#define BACNET_TARGET_IP BACNET_TARGET_ADDRESS
#else
#define BACNET_TARGET_IP "192.168.2.101"
#endif
#endif

#ifndef BACNET_TARGET_ADDRESS
#define BACNET_TARGET_ADDRESS BACNET_TARGET_IP
#endif

#ifndef BACNET_TARGET_PORT
#define BACNET_TARGET_PORT BacnetClient::kDefaultPort
#endif

#ifndef BACNET_TARGET_DEVICE_INSTANCE
#define BACNET_TARGET_DEVICE_INSTANCE 1682101
#endif

#ifndef BACNET_EXPECT_AV_INSTANCE
#define BACNET_EXPECT_AV_INSTANCE 220
#endif

#ifndef BACNET_EXPECT_MV_INSTANCE
#define BACNET_EXPECT_MV_INSTANCE 2020
#endif

#ifndef HIL_EXPECT_MOVING_PRESENT_VALUE
#define HIL_EXPECT_MOVING_PRESENT_VALUE false
#endif

#ifndef HIL_EXPECT_COV_SUPPORTED
#define HIL_EXPECT_COV_SUPPORTED false
#endif

#ifndef HIL_ENABLE_PROCESS_PRESENT_VALUE_READS
#define HIL_ENABLE_PROCESS_PRESENT_VALUE_READS true
#endif

#ifndef HIL_ENABLE_PROCESS_STATUS_READS
#define HIL_ENABLE_PROCESS_STATUS_READS true
#endif

#ifndef HIL_AI100_ANALOG_INPUT
#define HIL_AI100_ANALOG_INPUT 100
#endif

#ifndef HIL_REQUIRE_AI100
#define HIL_REQUIRE_AI100 true
#endif

#ifndef HIL_AI101_ANALOG_INPUT
#define HIL_AI101_ANALOG_INPUT 101
#endif

#ifndef HIL_REQUIRE_AI101
#define HIL_REQUIRE_AI101 false
#endif

#ifndef HIL_AO110_ANALOG_OUTPUT
#define HIL_AO110_ANALOG_OUTPUT 110
#endif

#ifndef HIL_REQUIRE_AO110
#define HIL_REQUIRE_AO110 true
#endif

#ifndef HIL_AO111_ANALOG_OUTPUT
#define HIL_AO111_ANALOG_OUTPUT 111
#endif

#ifndef HIL_REQUIRE_AO111
#define HIL_REQUIRE_AO111 false
#endif

#ifndef HIL_AV220_ANALOG_VALUE
#define HIL_AV220_ANALOG_VALUE 220
#endif

#ifndef HIL_REQUIRE_AV220
#define HIL_REQUIRE_AV220 true
#endif

#ifndef HIL_AV221_ANALOG_VALUE
#define HIL_AV221_ANALOG_VALUE 221
#endif

#ifndef HIL_REQUIRE_AV221
#define HIL_REQUIRE_AV221 false
#endif

#ifndef HIL_BI300_BINARY_INPUT
#define HIL_BI300_BINARY_INPUT 300
#endif

#ifndef HIL_REQUIRE_BI300
#define HIL_REQUIRE_BI300 true
#endif

#ifndef HIL_BI301_BINARY_INPUT
#define HIL_BI301_BINARY_INPUT 301
#endif

#ifndef HIL_REQUIRE_BI301
#define HIL_REQUIRE_BI301 false
#endif

#ifndef HIL_BO310_BINARY_OUTPUT
#define HIL_BO310_BINARY_OUTPUT 310
#endif

#ifndef HIL_REQUIRE_BO310
#define HIL_REQUIRE_BO310 true
#endif

#ifndef HIL_BO311_BINARY_OUTPUT
#define HIL_BO311_BINARY_OUTPUT 311
#endif

#ifndef HIL_REQUIRE_BO311
#define HIL_REQUIRE_BO311 false
#endif

#ifndef HIL_BV320_BINARY_VALUE
#define HIL_BV320_BINARY_VALUE 320
#endif

#ifndef HIL_REQUIRE_BV320
#define HIL_REQUIRE_BV320 true
#endif

#ifndef HIL_BV321_BINARY_VALUE
#define HIL_BV321_BINARY_VALUE 321
#endif

#ifndef HIL_REQUIRE_BV321
#define HIL_REQUIRE_BV321 false
#endif

#ifndef HIL_MI400_MULTISTATE_INPUT
#define HIL_MI400_MULTISTATE_INPUT 400
#endif

#ifndef HIL_REQUIRE_MI400
#define HIL_REQUIRE_MI400 true
#endif

#ifndef HIL_MI401_MULTISTATE_INPUT
#define HIL_MI401_MULTISTATE_INPUT 401
#endif

#ifndef HIL_REQUIRE_MI401
#define HIL_REQUIRE_MI401 false
#endif

#ifndef HIL_MO410_MULTISTATE_OUTPUT
#define HIL_MO410_MULTISTATE_OUTPUT 410
#endif

#ifndef HIL_REQUIRE_MO410
#define HIL_REQUIRE_MO410 true
#endif

#ifndef HIL_MO411_MULTISTATE_OUTPUT
#define HIL_MO411_MULTISTATE_OUTPUT 411
#endif

#ifndef HIL_REQUIRE_MO411
#define HIL_REQUIRE_MO411 false
#endif

#ifndef HIL_MV2020_MULTISTATE_VALUE
#define HIL_MV2020_MULTISTATE_VALUE 2020
#endif

#ifndef HIL_REQUIRE_MV2020
#define HIL_REQUIRE_MV2020 true
#endif

#ifndef HIL_MV2021_MULTISTATE_VALUE
#define HIL_MV2021_MULTISTATE_VALUE 2021
#endif

#ifndef HIL_REQUIRE_MV2021
#define HIL_REQUIRE_MV2021 false
#endif

#ifndef HIL_ENABLE_WRITE_TESTS
#define HIL_ENABLE_WRITE_TESTS false
#endif

#ifndef HIL_ENABLE_PRIORITY_WRITE_TESTS
#define HIL_ENABLE_PRIORITY_WRITE_TESTS false
#endif

#ifndef HIL_PRIORITY_WRITE_RESET_PROBE_ONLY
#define HIL_PRIORITY_WRITE_RESET_PROBE_ONLY false
#endif

#ifndef HIL_PRIORITY_WRITE_RESUME_PROBE_ONLY
#define HIL_PRIORITY_WRITE_RESUME_PROBE_ONLY false
#endif

#ifndef HIL_PRIORITY_WRITE_AV_INSTANCE
#define HIL_PRIORITY_WRITE_AV_INSTANCE 200
#endif

#ifndef HIL_PRIORITY_WRITE_BV_INSTANCE
#define HIL_PRIORITY_WRITE_BV_INSTANCE 320
#endif

#ifndef HIL_PRIORITY_WRITE_MSV_INSTANCE
#define HIL_PRIORITY_WRITE_MSV_INSTANCE 2020
#endif

namespace {

using namespace bacnet_hil;

constexpr uint32_t kNetworkConnectTimeoutMs = 30000;
constexpr uint32_t kNetworkRetryDelayMs = 250;
constexpr uint32_t kScanTimeoutMs = 90000;
constexpr uint32_t kScanReadTimeoutMs = 3000;
constexpr uint32_t kPollDelayMs = 10;
constexpr uint32_t kPriorityWriteObservationDelayMs = 1000;
constexpr uint8_t kPriorityWriteObservationCount = 3;
constexpr uint8_t kPriorityWritePriority = 8;
constexpr uint32_t kMaxObjectListEntries = 600;
constexpr size_t kMaxScanResults = 40;
struct S02TargetSpec {
  const char* label = "";
  BacnetObjectType type = BacnetObjectType::AnalogValue;
  uint32_t instance = 0;
  bool required = false;
};

struct PriorityWriteTarget {
  const char* label = "";
  BacnetObjectType type = BacnetObjectType::AnalogValue;
  uint32_t instance = 0;
};

bool hasExpectedPresentValueType(BacnetObjectType type, const BacnetValue& value) {
  if (bacnetIsAnalogProcessObject(type)) {
    return value.type == BacnetValueType::Real;
  }
  if (bacnetIsBinaryProcessObject(type)) {
    return value.type == BacnetValueType::Enumerated;
  }
  if (bacnetIsMultiStateProcessObject(type)) {
    return value.type == BacnetValueType::Unsigned ||
           value.type == BacnetValueType::Enumerated;
  }
  return false;
}

const char* expectedPresentValueTypeText(BacnetObjectType type) {
  if (bacnetIsAnalogProcessObject(type)) {
    return "real";
  }
  if (bacnetIsBinaryProcessObject(type)) {
    return "enumerated";
  }
  if (bacnetIsMultiStateProcessObject(type)) {
    return "unsigned-or-enumerated";
  }
  return "unknown";
}

void printS02ObjectLine(ScenarioOutcome outcome, const S02TargetSpec& target, BacnetDeviceSessionReadStatus status, const BacnetValue* value, bool expectedTypeOk, bool configured) {
  Serial.print("[");
  Serial.print(scenarioOutcomeText(outcome));
  Serial.print("] S02 ");
  Serial.print(target.label);
  Serial.print(" ");
  Serial.print(bacnetObjectTypeText(target.type));
  Serial.print("(type=");
  Serial.print(static_cast<unsigned>(static_cast<uint16_t>(target.type)));
  Serial.print(")");
  Serial.print(",");
  Serial.print(target.instance);
  Serial.print(" property=present-value read-status=");
  Serial.print(bacnetReadStatusText(status));

  if (!configured) {
    Serial.print(" not-configured");
  } else if (status == BacnetDeviceSessionReadStatus::Ack && value != nullptr) {
    Serial.print(" value=");
    Serial.print(value->displayText());
    Serial.print(" type=");
    Serial.print(bacnetValueTypeName(value->type));
    if (!expectedTypeOk) {
      Serial.print(" expected=");
      Serial.print(expectedPresentValueTypeText(target.type));
    }
  }
  Serial.println();
}

