vitalyruhl/esp32-bacnet-stack/examples/hil-wago-client-acceptance/src/main.cpp
ScenarioOutcome runCommonProcessStatusReadScenario() {
  if (!ensureRuntimeReady()) {
    return ScenarioOutcome::Fail;
  }

  BacnetDeviceSession device(client, BACNET_TARGET_DEVICE_INSTANCE, bacnetIpEndpointFromArduino(targetAddress, BACNET_TARGET_PORT));
  const S02TargetSpec targets[] = {
    {"AI100", BacnetObjectType::AnalogInput, HIL_AI100_ANALOG_INPUT, HIL_REQUIRE_AI100},
    {"AI101", BacnetObjectType::AnalogInput, HIL_AI101_ANALOG_INPUT, HIL_REQUIRE_AI101},
    {"AO110", BacnetObjectType::AnalogOutput, HIL_AO110_ANALOG_OUTPUT, HIL_REQUIRE_AO110},
    {"AO111", BacnetObjectType::AnalogOutput, HIL_AO111_ANALOG_OUTPUT, HIL_REQUIRE_AO111},
    {"AV220", BacnetObjectType::AnalogValue, HIL_AV220_ANALOG_VALUE, HIL_REQUIRE_AV220},
    {"AV221", BacnetObjectType::AnalogValue, HIL_AV221_ANALOG_VALUE, HIL_REQUIRE_AV221},
    {"BI300", BacnetObjectType::BinaryInput, HIL_BI300_BINARY_INPUT, HIL_REQUIRE_BI300},
    {"BI301", BacnetObjectType::BinaryInput, HIL_BI301_BINARY_INPUT, HIL_REQUIRE_BI301},
    {"BO310", BacnetObjectType::BinaryOutput, HIL_BO310_BINARY_OUTPUT, HIL_REQUIRE_BO310},
    {"BO311", BacnetObjectType::BinaryOutput, HIL_BO311_BINARY_OUTPUT, HIL_REQUIRE_BO311},
    {"BV320", BacnetObjectType::BinaryValue, HIL_BV320_BINARY_VALUE, HIL_REQUIRE_BV320},
    {"BV321", BacnetObjectType::BinaryValue, HIL_BV321_BINARY_VALUE, HIL_REQUIRE_BV321},
    {"MI400", BacnetObjectType::MultiStateInput, HIL_MI400_MULTISTATE_INPUT, HIL_REQUIRE_MI400},
    {"MI401", BacnetObjectType::MultiStateInput, HIL_MI401_MULTISTATE_INPUT, HIL_REQUIRE_MI401},
    {"MO410", BacnetObjectType::MultiStateOutput, HIL_MO410_MULTISTATE_OUTPUT, HIL_REQUIRE_MO410},
    {"MO411", BacnetObjectType::MultiStateOutput, HIL_MO411_MULTISTATE_OUTPUT, HIL_REQUIRE_MO411},
    {"MV2020", BacnetObjectType::MultiStateValue, HIL_MV2020_MULTISTATE_VALUE, HIL_REQUIRE_MV2020},
    {"MV2021", BacnetObjectType::MultiStateValue, HIL_MV2021_MULTISTATE_VALUE, HIL_REQUIRE_MV2021},
  };

  size_t configuredTargets = 0;
  size_t passedTargets = 0;
  size_t skippedTargets = 0;
  size_t optionalFailures = 0;
  size_t requiredFailures = 0;

  for (const S02TargetSpec& target : targets) {
    if (target.instance == 0) {
      ++skippedTargets;
      BacnetObjectStatus skippedStatus;
      printStatusSnapshotLine(ScenarioOutcome::Skip, target, skippedStatus, false);
      continue;
    }

    ++configuredTargets;
    BacnetObjectStatus status;
    device.readObjectStatus(target.type, target.instance, status, kScanReadTimeoutMs, target.required);
    const bool targetOk = hasSafeObjectStatusSnapshot(status, target.required);
    printStatusSnapshotLine(targetOk ? ScenarioOutcome::Pass
                                     : ScenarioOutcome::Fail,
                            target,
                            status,
                            true);

    if (targetOk) {
      ++passedTargets;
    } else if (target.required) {
      ++requiredFailures;
    } else {
      ++optionalFailures;
    }
  }

  Serial.print("[HIL] S03 configured=");
  Serial.print(configuredTargets);
  Serial.print(" passed=");
  Serial.print(passedTargets);
  Serial.print(" optional-failures=");
  Serial.print(optionalFailures);
  Serial.print(" required-failures=");
  Serial.print(requiredFailures);
  Serial.print(" skipped=");
  Serial.println(skippedTargets);

  if (configuredTargets == 0) {
    printResult("I", "S03 target objects not configured");
    return ScenarioOutcome::Skip;
  }

  return (passedTargets > 0 && requiredFailures == 0)
           ? ScenarioOutcome::Pass
           : ScenarioOutcome::Fail;
}

ScenarioOutcome runPropertyCacheScenario() {
  printResult("I", "property cache scenario not implemented yet");
  return ScenarioOutcome::Fail;
}

ScenarioOutcome runSubscribeAnyPropertyScenario() {
  printResult("I", "subscribe-any-property scenario not implemented yet");
  return ScenarioOutcome::Fail;
}

ScenarioOutcome runFallbackPollingValueChangeScenario() {
  printResult("I", "fallback polling value-change scenario not implemented yet");
  return ScenarioOutcome::Fail;
}

ScenarioOutcome runSubscribeCovScenario() {
  printResult("I", "SubscribeCOV scenario not implemented yet");
  return ScenarioOutcome::Fail;
}

ScenarioOutcome runWritePropertyScenario() {
  printResult("I", "WriteProperty scenario enabled but no writes executed");
  return ScenarioOutcome::Fail;
}

bool priorityWriteValueEquals(const BacnetValue& left, const BacnetValue& right) {
  return bacnet_example::hil::valuesEqual(left, right);
}

void printPriorityWriteValue(const PriorityWriteTarget& target,
                             const char* stage,
                             BacnetDeviceSessionReadStatus status,
                             const BacnetValue& value) {
  Serial.print("[HIL] priority-write ");
  Serial.print(target.label);
  Serial.print(" ");
  Serial.print(bacnetObjectTypeText(target.type));
  Serial.print(",");
  Serial.print(target.instance);
  Serial.print(" ");
  Serial.print(stage);
  Serial.print(" status=");
  Serial.print(bacnetReadStatusText(status));
  Serial.print(" value=");
  Serial.print(value.displayText());
  Serial.print(" type=");
  Serial.println(bacnetValueTypeName(value.type));
}

void printPriorityWritePropertyStatus(const PriorityWriteTarget& target,
                                      const char* stage,
                                      BacnetPropertyReadStatus status,
                                      const BacnetValue& value) {
  Serial.print("[HIL] priority-write ");
  Serial.print(target.label);
  Serial.print(" ");
  Serial.print(stage);
  Serial.print(" status=");
  Serial.print(bacnetPropertyReadStatusText(status));
  Serial.print(" value=");
  Serial.println(value.displayText());
}

void printPriorityWriteArrayStatus(const PriorityWriteTarget& target,
                                   const char* stage,
                                   BacnetPropertyReadStatus status,
                                   const BacnetPriorityArray& value) {
  Serial.print("[HIL] priority-write ");
  Serial.print(target.label);
  Serial.print(" ");
  Serial.print(stage);
  Serial.print(" status=");
  Serial.println(bacnetPropertyReadStatusText(status));
  if (status != BacnetPropertyReadStatus::Ack) {
    return;
  }
  for (size_t slot = 0; slot < BacnetPriorityArray::kSlotCount; ++slot) {
    Serial.print("[HIL] priority-write ");
    Serial.print(target.label);
    Serial.print(" ");
    Serial.print(stage);
    Serial.print("[");
    Serial.print(slot + 1);
    Serial.print("] value=");
    Serial.print(value.slots[slot].displayText());
    Serial.print(" present=");
    Serial.println(value.present[slot] ? "yes" : "no");
  }
}

void printPriorityWriteStatus(const PriorityWriteTarget& target,
                              const char* stage,
                              BacnetDeviceSessionWriteStatus status) {
  Serial.print("[HIL] priority-write ");
  Serial.print(target.label);
  Serial.print(" ");
  Serial.print(stage);
  Serial.print(" status=");
  Serial.println(bacnetWriteStatusText(status));
}

bool cleanupPriorityWrite(BacnetRemoteObject& object,
                          const PriorityWriteTarget& target,
                          bool& priorityActive) {
  if (!priorityActive) {
    return true;
  }
  const BacnetDeviceSessionWriteStatus cleanupStatus =
    object.relinquishPresentValue(kPriorityWritePriority, kScanReadTimeoutMs);
  printPriorityWriteStatus(target, "relinquish-priority-8-cleanup", cleanupStatus);
  if (cleanupStatus == BacnetDeviceSessionWriteStatus::Ack) {
    priorityActive = false;
    printResult("I", "priority cleanup acknowledged after failed scenario step");
    return true;
  }
  printResult("FAIL", "priority cleanup failed; priority override may remain active");
  return false;
}

