vitalyruhl/esp32-bacnet-stack/examples/hil-wago-client-acceptance/src/main.cpp
void printPriorityWriteReset(const PriorityWriteTarget& target,
                             const char* mode,
                             const BacnetPriorityRelinquishResult& result) {
  Serial.print("[HIL] priority-write ");
  Serial.print(target.label);
  Serial.print(" reset status=");
  Serial.print(bacnetWriteStatusText(result.status));
  Serial.print(" mode=");
  Serial.print(mode);
  Serial.print(" completed=");
  Serial.print(result.completedPriorities);
  Serial.print(" skipped-priority=");
  Serial.print(result.skippedPriority);
  Serial.print(" failed-priority=");
  Serial.println(result.failedPriority);
}

bool readPriorityWriteSlot(BacnetRemoteObject& object,
                           const PriorityWriteTarget& target,
                           uint8_t priority,
                           const char* stage,
                           BacnetValue& value) {
  const BacnetPropertyReadStatus status = object.readPriorityArray(
    value, kScanReadTimeoutMs, priority);
  printPriorityWritePropertyStatus(target, stage, status, value);
  return status == BacnetPropertyReadStatus::Ack ||
         status == BacnetPropertyReadStatus::EmptyValue;
}

bool makePriorityWriteValue(BacnetRemoteObject& object,
                            const PriorityWriteTarget& target,
                            const BacnetValue& current,
                            BacnetValue& value) {
  return bacnet_example::hil::selectTemporaryValue(
    object, target.type, current, kScanReadTimeoutMs, value);
}

bool observePriorityWriteValue(BacnetRemoteObject& object,
                               const PriorityWriteTarget& target,
                               const BacnetValue& expected,
                               const char* stage,
                               bool requireExpectedValue) {
  BacnetValue first;
  BacnetValue last;
  for (uint8_t observation = 0; observation < kPriorityWriteObservationCount;
       ++observation) {
    BacnetValue value;
    const BacnetDeviceSessionReadStatus status =
      object.readPresentValue(value, kScanReadTimeoutMs);
    printPriorityWriteValue(target, stage, status, value);
    if (status != BacnetDeviceSessionReadStatus::Ack ||
        (requireExpectedValue && !priorityWriteValueEquals(value, expected))) {
      return false;
    }
    if (observation == 0) {
      first = value;
    }
    last = value;
    if (observation + 1 < kPriorityWriteObservationCount) {
      delay(kPriorityWriteObservationDelayMs);
    }
  }
  return target.type != BacnetObjectType::AnalogValue || requireExpectedValue ||
         !priorityWriteValueEquals(first, last);
}

bool verifyPriorityWriteReset(BacnetRemoteObject& object,
                              const PriorityWriteTarget& target) {
  for (uint8_t priority = 1; priority <= 16; ++priority) {
    BacnetValue value;
    if (!readPriorityWriteSlot(object, target, priority, "priority-array-reset", value)) {
      return false;
    }
    if (priority != kMinimumOnOffPriority && priority != 16 &&
        value.type != BacnetValueType::Null) {
      return false;
    }
  }
  return true;
}

ScenarioOutcome runPriorityResetProbeScenario() {
  if (!ensureRuntimeReady()) {
    return ScenarioOutcome::Fail;
  }

  const PriorityWriteTarget target{
    "AV", BacnetObjectType::AnalogValue, HIL_PRIORITY_WRITE_AV_INSTANCE};
  BacnetDeviceSession device(
    client,
    BACNET_TARGET_DEVICE_INSTANCE,
    bacnetIpEndpointFromArduino(targetAddress, BACNET_TARGET_PORT));
  BacnetRemoteObject object = device.object(target.type, target.instance);

  BacnetValue original;
  const BacnetDeviceSessionReadStatus originalStatus =
    object.readPresentValue(original, kScanReadTimeoutMs);
  printPriorityWriteValue(target, "reset-probe-original-present-value", originalStatus, original);
  if (originalStatus != BacnetDeviceSessionReadStatus::Ack ||
      !hasExpectedPresentValueType(target.type, original)) {
    return ScenarioOutcome::Fail;
  }

  BacnetPriorityResetOptions resetOptions;
  resetOptions.skipMinimumOnOffPriority = true;
  const BacnetPriorityRelinquishResult reset =
    object.relinquishAllPriorities(resetOptions, kScanReadTimeoutMs);
  printPriorityWriteReset(target, "writable", reset);
  if (!reset.succeeded() || reset.completedPriorities != 15 ||
      reset.skippedPriority != kMinimumOnOffPriority) {
    return ScenarioOutcome::Fail;
  }

  // The HIL runner executes serially from setup(). Keep the 16-slot result
  // out of the Arduino loopTask stack.
  static BacnetPriorityArray priorityArray;
  const BacnetPropertyReadStatus priorityArrayStatus =
    object.readPriorityArray(priorityArray, kScanReadTimeoutMs);
  printPriorityWriteArrayStatus(target, "priority-array-reset-probe", priorityArrayStatus, priorityArray);
  if (priorityArrayStatus != BacnetPropertyReadStatus::Ack) {
    return ScenarioOutcome::Fail;
  }
  for (size_t slot = 0; slot < BacnetPriorityArray::kSlotCount; ++slot) {
    if (slot != kMinimumOnOffPriority - 1 &&
        priorityArray.slots[slot].type != BacnetValueType::Null) {
      return ScenarioOutcome::Fail;
    }
  }

  BacnetValue slotSix;
  BacnetValue slotEight;
  BacnetValue slotSixteen;
  if (!readPriorityWriteSlot(object, target, kMinimumOnOffPriority, "priority-array[6]-reset-probe", slotSix) ||
      !readPriorityWriteSlot(object, target, kPriorityWritePriority, "priority-array[8]-reset-probe", slotEight) ||
      slotEight.type != BacnetValueType::Null ||
      !readPriorityWriteSlot(object, target, 16, "priority-array[16]-reset-probe", slotSixteen) ||
      slotSixteen.type != BacnetValueType::Null) {
    return ScenarioOutcome::Fail;
  }
  BacnetValue relinquishDefault;
  const BacnetPropertyReadStatus relinquishDefaultStatus =
    object.readRelinquishDefault(relinquishDefault, kScanReadTimeoutMs);
  printPriorityWritePropertyStatus(
    target, "relinquish-default-reset-probe", relinquishDefaultStatus, relinquishDefault);
  BacnetValue presentValue;
  const BacnetDeviceSessionReadStatus presentValueStatus =
    object.readPresentValue(presentValue, kScanReadTimeoutMs);
  printPriorityWriteValue(
    target, "reset-probe-present-value", presentValueStatus, presentValue);
  if (presentValueStatus != BacnetDeviceSessionReadStatus::Ack ||
      (relinquishDefaultStatus == BacnetPropertyReadStatus::Ack &&
       !priorityWriteValueEquals(presentValue, relinquishDefault))) {
    return ScenarioOutcome::Fail;
  }
  return ScenarioOutcome::Pass;
}

