vitalyruhl/esp32-bacnet-stack/examples/hil-wago-client-acceptance/src/main.cpp
ScenarioOutcome runPriorityResumeProbeScenario() {
  if (!ensureRuntimeReady()) {
    return ScenarioOutcome::Fail;
  }

  const PriorityWriteTarget target{
    "AV", BacnetObjectType::AnalogValue, HIL_PRIORITY_WRITE_AV_INSTANCE};
  BacnetDeviceSession device(
    client,
    BACNET_TARGET_DEVICE_INSTANCE,
    bacnetIpEndpointFromArduino(targetAddress, BACNET_TARGET_PORT));
  BacnetRemoteObject object = device.object(target.type, target.instance);

  BacnetValue slotEight;
  if (!readPriorityWriteSlot(object, target, kPriorityWritePriority, "priority-array[8]-resume-probe", slotEight) ||
      slotEight.type != BacnetValueType::Null) {
    return ScenarioOutcome::Fail;
  }

  BacnetValue firstPresentValue;
  BacnetValue lastPresentValue;
  for (uint8_t observation = 0;
       observation < kPriorityWriteObservationCount;
       ++observation) {
    BacnetValue slotSixteen;
    if (!readPriorityWriteSlot(object, target, 16, "priority-array[16]-resume-probe", slotSixteen) ||
        slotSixteen.type == BacnetValueType::Null) {
      return ScenarioOutcome::Fail;
    }
    BacnetValue presentValue;
    const BacnetDeviceSessionReadStatus presentValueStatus =
      object.readPresentValue(presentValue, kScanReadTimeoutMs);
    printPriorityWriteValue(
      target, "resume-probe-present-value", presentValueStatus, presentValue);
    if (presentValueStatus != BacnetDeviceSessionReadStatus::Ack ||
        !priorityWriteValueEquals(presentValue, slotSixteen)) {
      return ScenarioOutcome::Fail;
    }
    if (observation == 0) {
      firstPresentValue = presentValue;
    }
    lastPresentValue = presentValue;
    if (observation + 1 < kPriorityWriteObservationCount) {
      delay(kPriorityWriteObservationDelayMs);
    }
  }
  return !priorityWriteValueEquals(firstPresentValue, lastPresentValue)
           ? ScenarioOutcome::Pass
           : ScenarioOutcome::Fail;
}

ScenarioOutcome runPresentValuePriorityWriteScenario() {
  if (!ensureRuntimeReady()) {
    return ScenarioOutcome::Fail;
  }

  const PriorityWriteTarget targets[] = {
    {"AV", BacnetObjectType::AnalogValue, HIL_PRIORITY_WRITE_AV_INSTANCE},
    {"BV", BacnetObjectType::BinaryValue, HIL_PRIORITY_WRITE_BV_INSTANCE},
    {"MSV", BacnetObjectType::MultiStateValue, HIL_PRIORITY_WRITE_MSV_INSTANCE},
  };
  for (const PriorityWriteTarget& target : targets) {
    BacnetDeviceSession device(
      client,
      BACNET_TARGET_DEVICE_INSTANCE,
      bacnetIpEndpointFromArduino(targetAddress, BACNET_TARGET_PORT));
    BacnetRemoteObject object = device.object(target.type, target.instance);
    BacnetValue original;
    const BacnetDeviceSessionReadStatus originalStatus =
      object.readPresentValue(original, kScanReadTimeoutMs);
    printPriorityWriteValue(target, "original-present-value", originalStatus, original);
    if (originalStatus != BacnetDeviceSessionReadStatus::Ack ||
        !hasExpectedPresentValueType(target.type, original)) {
      return ScenarioOutcome::Fail;
    }

    // The HIL runner executes serially from setup(). Keep the 16-slot result
    // out of the Arduino loopTask stack.
    static BacnetPriorityArray priorityArray;
    const BacnetPropertyReadStatus priorityArrayStatus =
      object.readPriorityArray(priorityArray, kScanReadTimeoutMs);
    printPriorityWriteArrayStatus(target, "priority-array", priorityArrayStatus, priorityArray);
    if (priorityArrayStatus != BacnetPropertyReadStatus::Ack) {
      return ScenarioOutcome::Fail;
    }

    BacnetValue relinquishDefault;
    const BacnetPropertyReadStatus relinquishDefaultStatus =
      object.readRelinquishDefault(relinquishDefault, kScanReadTimeoutMs);
    printPriorityWritePropertyStatus(target, "relinquish-default", relinquishDefaultStatus, relinquishDefault);
    if (relinquishDefaultStatus != BacnetPropertyReadStatus::Ack &&
        relinquishDefaultStatus != BacnetPropertyReadStatus::UnsupportedProperty) {
      return ScenarioOutcome::Fail;
    }

    BacnetValue slot8Before;
    BacnetValue slot16Before;
    if (!readPriorityWriteSlot(object, target, kPriorityWritePriority, "priority-array[8]-before", slot8Before) ||
        !readPriorityWriteSlot(object, target, 16, "priority-array[16]-before", slot16Before)) {
      return ScenarioOutcome::Fail;
    }

    BacnetValue temporary;
    if (!makePriorityWriteValue(object, target, original, temporary)) {
      printResult("FAIL", "priority write test value is invalid for object");
      return ScenarioOutcome::Fail;
    }
    printPriorityWriteValue(target, "temporary-value", BacnetDeviceSessionReadStatus::Ack, temporary);
    const BacnetDeviceSessionWriteStatus writeStatus =
      object.writePresentValue(temporary, kPriorityWritePriority, kScanReadTimeoutMs);
    printPriorityWriteStatus(target, "write-priority-8", writeStatus);
    if (writeStatus != BacnetDeviceSessionWriteStatus::Ack) {
      return ScenarioOutcome::Fail;
    }
    bool priorityActive = true;

    if (!observePriorityWriteValue(object, target, temporary, "priority-8-active", true)) {
      cleanupPriorityWrite(object, target, priorityActive);
      return ScenarioOutcome::Fail;
    }
    const BacnetPropertyReadStatus activePriorityArrayStatus =
      object.readPriorityArray(priorityArray, kScanReadTimeoutMs);
    printPriorityWriteArrayStatus(
      target, "priority-array-priority-8-active", activePriorityArrayStatus, priorityArray);
    if (activePriorityArrayStatus != BacnetPropertyReadStatus::Ack ||
        !priorityWriteValueEquals(priorityArray.slots[kPriorityWritePriority - 1], temporary)) {
      cleanupPriorityWrite(object, target, priorityActive);
      return ScenarioOutcome::Fail;
    }
    BacnetValue slot8Active;
    BacnetValue slot16Active;
    if (!readPriorityWriteSlot(object, target, kPriorityWritePriority, "priority-array[8]-active", slot8Active) ||
        !readPriorityWriteSlot(object, target, 16, "priority-array[16]-active", slot16Active) ||
        !priorityWriteValueEquals(slot8Active, temporary)) {
      printResult("FAIL", "priority 8 did not contain the temporary value");
      cleanupPriorityWrite(object, target, priorityActive);
      return ScenarioOutcome::Fail;
    }

    const BacnetDeviceSessionWriteStatus relinquishStatus =
      object.relinquishPresentValue(kPriorityWritePriority, kScanReadTimeoutMs);
    printPriorityWriteStatus(target, "relinquish-priority-8", relinquishStatus);
    if (relinquishStatus != BacnetDeviceSessionWriteStatus::Ack) {
      cleanupPriorityWrite(object, target, priorityActive);
      return ScenarioOutcome::Fail;
    }
    priorityActive = false;
    BacnetValue slot8Relinquished;
    if (!readPriorityWriteSlot(object, target, kPriorityWritePriority, "priority-array[8]-relinquished", slot8Relinquished) ||
        slot8Relinquished.type != BacnetValueType::Null) {
      printResult("FAIL", "priority 8 was not relinquished with Null");
      return ScenarioOutcome::Fail;
    }
    if (!observePriorityWriteValue(object, target, slot16Active, "priority-16-resumed", false)) {
      return ScenarioOutcome::Fail;
    }

    BacnetPriorityResetOptions resetOptions;
    resetOptions.skipMinimumOnOffPriority = true;
    const BacnetPriorityRelinquishResult reset =
      object.relinquishAllPriorities(resetOptions, kScanReadTimeoutMs);
    printPriorityWriteReset(target, "writable", reset);
    if (!reset.succeeded() || reset.completedPriorities != 15 ||
        reset.skippedPriority != kMinimumOnOffPriority ||
        !verifyPriorityWriteReset(object, target) ||
        !observePriorityWriteValue(object, target, slot16Active, "priority-reset-resumed", false)) {
      return ScenarioOutcome::Fail;
    }
  }
  return ScenarioOutcome::Pass;
}

ScenarioOutcome runAcceptanceRunner() {
  ScenarioSummary summary;

