vitalyruhl/esp32-bacnet-stack/examples/hil-wago-client-acceptance/src/main.cpp
#if !HIL_HAS_LOCAL_SECRETS
  printResult("SKIP", "local HIL secrets missing");
  summary.total = 1;
  summary.skip = 1;
  printFinalSummary(summary, ScenarioOutcome::Skip);
  return ScenarioOutcome::Skip;
#else
  runScenario(summary, "S01", "non-blocking object-list scan", true, true, runNonBlockingObjectListScanScenario, "disabled");

  runScenario(summary, "S02", "common process present-value reads", HIL_ENABLE_PROCESS_PRESENT_VALUE_READS, false, runCommonProcessPresentValueReadScenario, "disabled (HIL_ENABLE_PROCESS_PRESENT_VALUE_READS=false)");

  runScenario(summary, "S03", "common process object status reads", HIL_ENABLE_PROCESS_STATUS_READS, false, runCommonProcessStatusReadScenario, "disabled (HIL_ENABLE_PROCESS_STATUS_READS=false)");

  runScenario(summary, "S04", "property cache", false, false, runPropertyCacheScenario, "disabled (future scenario block)");

  runScenario(summary, "S05", "subscribe-any-property", false, false, runSubscribeAnyPropertyScenario, "disabled (future scenario block)");

  runScenario(summary, "S06", "fallback polling value change", HIL_EXPECT_MOVING_PRESENT_VALUE, false, runFallbackPollingValueChangeScenario, "disabled (HIL_EXPECT_MOVING_PRESENT_VALUE=false)");

  runScenario(summary, "S07", "SubscribeCOV where supported", HIL_EXPECT_COV_SUPPORTED, false, runSubscribeCovScenario, "disabled (HIL_EXPECT_COV_SUPPORTED=false)");

  runScenario(summary, "S08", "WriteProperty (explicit opt-in)", HIL_ENABLE_WRITE_TESTS, false, runWritePropertyScenario, "disabled (HIL_ENABLE_WRITE_TESTS=false)");

  runScenario(
    summary,
    "S09",
    HIL_PRIORITY_WRITE_RESUME_PROBE_ONLY
      ? "PresentValue priority resume probe (read-only)"
    : HIL_PRIORITY_WRITE_RESET_PROBE_ONLY
      ? "PresentValue priority reset probe (explicit opt-in)"
      : "PresentValue priority write (explicit opt-in)",
    HIL_ENABLE_PRIORITY_WRITE_TESTS,
    false,
    HIL_PRIORITY_WRITE_RESUME_PROBE_ONLY
      ? runPriorityResumeProbeScenario
    : HIL_PRIORITY_WRITE_RESET_PROBE_ONLY
      ? runPriorityResetProbeScenario
      : runPresentValuePriorityWriteScenario,
    "disabled (HIL_ENABLE_PRIORITY_WRITE_TESTS=false)");

  ScenarioOutcome finalOutcome = ScenarioOutcome::Skip;
  if (summary.fail > 0 || summary.requiredFailed > 0) {
    finalOutcome = ScenarioOutcome::Fail;
  } else if (summary.requiredEnabled > 0) {
    finalOutcome = ScenarioOutcome::Pass;
  }

  printFinalSummary(summary, finalOutcome);
  return finalOutcome;
#endif
}

} // namespace

void setup() {
  Serial.begin(115200);
  delay(1000);
  const ScenarioOutcome outcome = runAcceptanceRunner();
  completed = true;
  printResult(scenarioOutcomeText(outcome), "HIL acceptance final result");
}

void loop() {
  if (completed) {
    delay(1000);
  }
}
